HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxHssl_bf.h
/** \\brief  Mask for Ifx_HSSL_ACCEN0_Bits.EN25 */
#define IFX_HSSL_ACCEN0_EN25_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_ACCEN0_Bits.EN25 */
#define IFX_HSSL_ACCEN0_EN25_OFF (25)

/** \\brief  Length for Ifx_HSSL_ACCEN0_Bits.EN26 */
#define IFX_HSSL_ACCEN0_EN26_LEN (1)

/** \\brief  Mask for Ifx_HSSL_ACCEN0_Bits.EN26 */
#define IFX_HSSL_ACCEN0_EN26_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_ACCEN0_Bits.EN26 */
#define IFX_HSSL_ACCEN0_EN26_OFF (26)

/** \\brief  Length for Ifx_HSSL_ACCEN0_Bits.EN27 */
#define IFX_HSSL_ACCEN0_EN27_LEN (1)

/** \\brief  Mask for Ifx_HSSL_ACCEN0_Bits.EN27 */
#define IFX_HSSL_ACCEN0_EN27_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_ACCEN0_Bits.EN27 */
#define IFX_HSSL_ACCEN0_EN27_OFF (27)

/** \\brief  Length for Ifx_HSSL_ACCEN0_Bits.EN28 */
#define IFX_HSSL_ACCEN0_EN28_LEN (1)

/** \\brief  Mask for Ifx_HSSL_ACCEN0_Bits.EN28 */
#define IFX_HSSL_ACCEN0_EN28_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_ACCEN0_Bits.EN28 */
#define IFX_HSSL_ACCEN0_EN28_OFF (28)

/** \\brief  Length for Ifx_HSSL_ACCEN0_Bits.EN29 */
#define IFX_HSSL_ACCEN0_EN29_LEN (1)

/** \\brief  Mask for Ifx_HSSL_ACCEN0_Bits.EN29 */
#define IFX_HSSL_ACCEN0_EN29_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_ACCEN0_Bits.EN29 */
#define IFX_HSSL_ACCEN0_EN29_OFF (29)

/** \\brief  Length for Ifx_HSSL_ACCEN0_Bits.EN2 */
#define IFX_HSSL_ACCEN0_EN2_LEN (1)

/** \\brief  Mask for Ifx_HSSL_ACCEN0_Bits.EN2 */
#define IFX_HSSL_ACCEN0_EN2_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_ACCEN0_Bits.EN2 */
#define IFX_HSSL_ACCEN0_EN2_OFF (2)

/** \\brief  Length for Ifx_HSSL_ACCEN0_Bits.EN30 */
#define IFX_HSSL_ACCEN0_EN30_LEN (1)

/** \\brief  Mask for Ifx_HSSL_ACCEN0_Bits.EN30 */
#define IFX_HSSL_ACCEN0_EN30_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_ACCEN0_Bits.EN30 */
#define IFX_HSSL_ACCEN0_EN30_OFF (30)

/** \\brief  Length for Ifx_HSSL_ACCEN0_Bits.EN31 */
#define IFX_HSSL_ACCEN0_EN31_LEN (1)

/** \\brief  Mask for Ifx_HSSL_ACCEN0_Bits.EN31 */
#define IFX_HSSL_ACCEN0_EN31_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_ACCEN0_Bits.EN31 */
#define IFX_HSSL_ACCEN0_EN31_OFF (31)

/** \\brief  Length for Ifx_HSSL_ACCEN0_Bits.EN3 */
#define IFX_HSSL_ACCEN0_EN3_LEN (1)

/** \\brief  Mask for Ifx_HSSL_ACCEN0_Bits.EN3 */
#define IFX_HSSL_ACCEN0_EN3_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_ACCEN0_Bits.EN3 */
#define IFX_HSSL_ACCEN0_EN3_OFF (3)

/** \\brief  Length for Ifx_HSSL_ACCEN0_Bits.EN4 */
#define IFX_HSSL_ACCEN0_EN4_LEN (1)

/** \\brief  Mask for Ifx_HSSL_ACCEN0_Bits.EN4 */
#define IFX_HSSL_ACCEN0_EN4_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_ACCEN0_Bits.EN4 */
#define IFX_HSSL_ACCEN0_EN4_OFF (4)

/** \\brief  Length for Ifx_HSSL_ACCEN0_Bits.EN5 */
#define IFX_HSSL_ACCEN0_EN5_LEN (1)

/** \\brief  Mask for Ifx_HSSL_ACCEN0_Bits.EN5 */
#define IFX_HSSL_ACCEN0_EN5_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_ACCEN0_Bits.EN5 */
#define IFX_HSSL_ACCEN0_EN5_OFF (5)

/** \\brief  Length for Ifx_HSSL_ACCEN0_Bits.EN6 */
#define IFX_HSSL_ACCEN0_EN6_LEN (1)

/** \\brief  Mask for Ifx_HSSL_ACCEN0_Bits.EN6 */
#define IFX_HSSL_ACCEN0_EN6_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_ACCEN0_Bits.EN6 */
#define IFX_HSSL_ACCEN0_EN6_OFF (6)

/** \\brief  Length for Ifx_HSSL_ACCEN0_Bits.EN7 */
#define IFX_HSSL_ACCEN0_EN7_LEN (1)

/** \\brief  Mask for Ifx_HSSL_ACCEN0_Bits.EN7 */
#define IFX_HSSL_ACCEN0_EN7_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_ACCEN0_Bits.EN7 */
#define IFX_HSSL_ACCEN0_EN7_OFF (7)

/** \\brief  Length for Ifx_HSSL_ACCEN0_Bits.EN8 */
#define IFX_HSSL_ACCEN0_EN8_LEN (1)

/** \\brief  Mask for Ifx_HSSL_ACCEN0_Bits.EN8 */
#define IFX_HSSL_ACCEN0_EN8_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_ACCEN0_Bits.EN8 */
#define IFX_HSSL_ACCEN0_EN8_OFF (8)

/** \\brief  Length for Ifx_HSSL_ACCEN0_Bits.EN9 */
#define IFX_HSSL_ACCEN0_EN9_LEN (1)

/** \\brief  Mask for Ifx_HSSL_ACCEN0_Bits.EN9 */
#define IFX_HSSL_ACCEN0_EN9_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_ACCEN0_Bits.EN9 */
#define IFX_HSSL_ACCEN0_EN9_OFF (9)

/** \\brief  Length for Ifx_HSSL_CFG_Bits.CCC */
#define IFX_HSSL_CFG_CCC_LEN (1)

/** \\brief  Mask for Ifx_HSSL_CFG_Bits.CCC */
#define IFX_HSSL_CFG_CCC_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_CFG_Bits.CCC */
#define IFX_HSSL_CFG_CCC_OFF (19)

/** \\brief  Length for Ifx_HSSL_CFG_Bits.PREDIV */
#define IFX_HSSL_CFG_PREDIV_LEN (14)

/** \\brief  Mask for Ifx_HSSL_CFG_Bits.PREDIV */
#define IFX_HSSL_CFG_PREDIV_MSK (0x3fff)

/** \\brief  Offset for Ifx_HSSL_CFG_Bits.PREDIV */
#define IFX_HSSL_CFG_PREDIV_OFF (0)

/** \\brief  Length for Ifx_HSSL_CFG_Bits.SCM */
#define IFX_HSSL_CFG_SCM_LEN (1)

/** \\brief  Mask for Ifx_HSSL_CFG_Bits.SCM */
#define IFX_HSSL_CFG_SCM_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_CFG_Bits.SCM */
#define IFX_HSSL_CFG_SCM_OFF (18)

/** \\brief  Length for Ifx_HSSL_CFG_Bits.SMR */
#define IFX_HSSL_CFG_SMR_LEN (1)

/** \\brief  Mask for Ifx_HSSL_CFG_Bits.SMR */
#define IFX_HSSL_CFG_SMR_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_CFG_Bits.SMR */
#define IFX_HSSL_CFG_SMR_OFF (17)

/** \\brief  Length for Ifx_HSSL_CFG_Bits.SMT */
#define IFX_HSSL_CFG_SMT_LEN (1)

/** \\brief  Mask for Ifx_HSSL_CFG_Bits.SMT */
#define IFX_HSSL_CFG_SMT_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_CFG_Bits.SMT */
#define IFX_HSSL_CFG_SMT_OFF (16)

/** \\brief  Length for Ifx_HSSL_CLC_Bits.DISR */
#define IFX_HSSL_CLC_DISR_LEN (1)

/** \\brief  Mask for Ifx_HSSL_CLC_Bits.DISR */
#define IFX_HSSL_CLC_DISR_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_CLC_Bits.DISR */
#define IFX_HSSL_CLC_DISR_OFF (0)

/** \\brief  Length for Ifx_HSSL_CLC_Bits.DISS */
#define IFX_HSSL_CLC_DISS_LEN (1)

/** \\brief  Mask for Ifx_HSSL_CLC_Bits.DISS */
#define IFX_HSSL_CLC_DISS_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_CLC_Bits.DISS */
#define IFX_HSSL_CLC_DISS_OFF (1)

/** \\brief  Length for Ifx_HSSL_CLC_Bits.EDIS */
#define IFX_HSSL_CLC_EDIS_LEN (1)

/** \\brief  Mask for Ifx_HSSL_CLC_Bits.EDIS */
#define IFX_HSSL_CLC_EDIS_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_CLC_Bits.EDIS */
#define IFX_HSSL_CLC_EDIS_OFF (3)

/** \\brief  Length for Ifx_HSSL_CRC_Bits.XEN */
#define IFX_HSSL_CRC_XEN_LEN (1)

/** \\brief  Mask for Ifx_HSSL_CRC_Bits.XEN */
#define IFX_HSSL_CRC_XEN_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_CRC_Bits.XEN */
#define IFX_HSSL_CRC_XEN_OFF (16)

/** \\brief  Length for Ifx_HSSL_CRC_Bits.XORMASK */
#define IFX_HSSL_CRC_XORMASK_LEN (16)

/** \\brief  Mask for Ifx_HSSL_CRC_Bits.XORMASK */
#define IFX_HSSL_CRC_XORMASK_MSK (0xffff)

/** \\brief  Offset for Ifx_HSSL_CRC_Bits.XORMASK */
#define IFX_HSSL_CRC_XORMASK_OFF (0)

/** \\brief  Length for Ifx_HSSL_I_ICON_Bits.BSY */
#define IFX_HSSL_I_ICON_BSY_LEN (1)

/** \\brief  Mask for Ifx_HSSL_I_ICON_Bits.BSY */
#define IFX_HSSL_I_ICON_BSY_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_I_ICON_Bits.BSY */
#define IFX_HSSL_I_ICON_BSY_OFF (20)

/** \\brief  Length for Ifx_HSSL_I_ICON_Bits.CETT */
#define IFX_HSSL_I_ICON_CETT_LEN (3)

/** \\brief  Mask for Ifx_HSSL_I_ICON_Bits.CETT */
#define IFX_HSSL_I_ICON_CETT_MSK (0x7)

/** \\brief  Offset for Ifx_HSSL_I_ICON_Bits.CETT */
#define IFX_HSSL_I_ICON_CETT_OFF (5)

/** \\brief  Length for Ifx_HSSL_I_ICON_Bits.DATLEN */
#define IFX_HSSL_I_ICON_DATLEN_LEN (2)

/** \\brief  Mask for Ifx_HSSL_I_ICON_Bits.DATLEN */
#define IFX_HSSL_I_ICON_DATLEN_MSK (0x3)

/** \\brief  Offset for Ifx_HSSL_I_ICON_Bits.DATLEN */
#define IFX_HSSL_I_ICON_DATLEN_OFF (16)

/** \\brief  Length for Ifx_HSSL_I_ICON_Bits.IDQ */
#define IFX_HSSL_I_ICON_IDQ_LEN (1)

/** \\brief  Mask for Ifx_HSSL_I_ICON_Bits.IDQ */
#define IFX_HSSL_I_ICON_IDQ_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_I_ICON_Bits.IDQ */
#define IFX_HSSL_I_ICON_IDQ_OFF (0)

/** \\brief  Length for Ifx_HSSL_I_ICON_Bits.ITTAG */
#define IFX_HSSL_I_ICON_ITTAG_LEN (3)

/** \\brief  Mask for Ifx_HSSL_I_ICON_Bits.ITTAG */
#define IFX_HSSL_I_ICON_ITTAG_MSK (0x7)

