HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxHssl_bf.h
/** \\brief  Offset for Ifx_HSSL_I_ICON_Bits.ITTAG */
#define IFX_HSSL_I_ICON_ITTAG_OFF (21)

/** \\brief  Length for Ifx_HSSL_I_ICON_Bits.LETT */
#define IFX_HSSL_I_ICON_LETT_LEN (3)

/** \\brief  Mask for Ifx_HSSL_I_ICON_Bits.LETT */
#define IFX_HSSL_I_ICON_LETT_MSK (0x7)

/** \\brief  Offset for Ifx_HSSL_I_ICON_Bits.LETT */
#define IFX_HSSL_I_ICON_LETT_OFF (2)

/** \\brief  Length for Ifx_HSSL_I_ICON_Bits.RWT */
#define IFX_HSSL_I_ICON_RWT_LEN (2)

/** \\brief  Mask for Ifx_HSSL_I_ICON_Bits.RWT */
#define IFX_HSSL_I_ICON_RWT_MSK (0x3)

/** \\brief  Offset for Ifx_HSSL_I_ICON_Bits.RWT */
#define IFX_HSSL_I_ICON_RWT_OFF (18)

/** \\brief  Length for Ifx_HSSL_I_ICON_Bits.TOCV */
#define IFX_HSSL_I_ICON_TOCV_LEN (8)

/** \\brief  Mask for Ifx_HSSL_I_ICON_Bits.TOCV */
#define IFX_HSSL_I_ICON_TOCV_MSK (0xff)

/** \\brief  Offset for Ifx_HSSL_I_ICON_Bits.TOCV */
#define IFX_HSSL_I_ICON_TOCV_OFF (8)

/** \\brief  Length for Ifx_HSSL_I_ICON_Bits.TOREL */
#define IFX_HSSL_I_ICON_TOREL_LEN (8)

/** \\brief  Mask for Ifx_HSSL_I_ICON_Bits.TOREL */
#define IFX_HSSL_I_ICON_TOREL_MSK (0xff)

/** \\brief  Offset for Ifx_HSSL_I_ICON_Bits.TOREL */
#define IFX_HSSL_I_ICON_TOREL_OFF (24)

/** \\brief  Length for Ifx_HSSL_I_ICON_Bits.TQ */
#define IFX_HSSL_I_ICON_TQ_LEN (1)

/** \\brief  Mask for Ifx_HSSL_I_ICON_Bits.TQ */
#define IFX_HSSL_I_ICON_TQ_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_I_ICON_Bits.TQ */
#define IFX_HSSL_I_ICON_TQ_OFF (1)

/** \\brief  Length for Ifx_HSSL_I_IRD_Bits.DATA */
#define IFX_HSSL_I_IRD_DATA_LEN (32)

/** \\brief  Mask for Ifx_HSSL_I_IRD_Bits.DATA */
#define IFX_HSSL_I_IRD_DATA_MSK (0xffffffff)

/** \\brief  Offset for Ifx_HSSL_I_IRD_Bits.DATA */
#define IFX_HSSL_I_IRD_DATA_OFF (0)

/** \\brief  Length for Ifx_HSSL_I_IRWA_Bits.ADDRESS */
#define IFX_HSSL_I_IRWA_ADDRESS_LEN (32)

/** \\brief  Mask for Ifx_HSSL_I_IRWA_Bits.ADDRESS */
#define IFX_HSSL_I_IRWA_ADDRESS_MSK (0xffffffff)

/** \\brief  Offset for Ifx_HSSL_I_IRWA_Bits.ADDRESS */
#define IFX_HSSL_I_IRWA_ADDRESS_OFF (0)

/** \\brief  Length for Ifx_HSSL_I_IWD_Bits.DATA */
#define IFX_HSSL_I_IWD_DATA_LEN (32)

/** \\brief  Mask for Ifx_HSSL_I_IWD_Bits.DATA */
#define IFX_HSSL_I_IWD_DATA_MSK (0xffffffff)

/** \\brief  Offset for Ifx_HSSL_I_IWD_Bits.DATA */
#define IFX_HSSL_I_IWD_DATA_OFF (0)

/** \\brief  Length for Ifx_HSSL_ID_Bits.MODNUMBER */
#define IFX_HSSL_ID_MODNUMBER_LEN (16)

/** \\brief  Mask for Ifx_HSSL_ID_Bits.MODNUMBER */
#define IFX_HSSL_ID_MODNUMBER_MSK (0xffff)

/** \\brief  Offset for Ifx_HSSL_ID_Bits.MODNUMBER */
#define IFX_HSSL_ID_MODNUMBER_OFF (16)

/** \\brief  Length for Ifx_HSSL_ID_Bits.MODREV */
#define IFX_HSSL_ID_MODREV_LEN (8)

/** \\brief  Mask for Ifx_HSSL_ID_Bits.MODREV */
#define IFX_HSSL_ID_MODREV_MSK (0xff)

/** \\brief  Offset for Ifx_HSSL_ID_Bits.MODREV */
#define IFX_HSSL_ID_MODREV_OFF (0)

/** \\brief  Length for Ifx_HSSL_ID_Bits.MODTYPE */
#define IFX_HSSL_ID_MODTYPE_LEN (8)

/** \\brief  Mask for Ifx_HSSL_ID_Bits.MODTYPE */
#define IFX_HSSL_ID_MODTYPE_MSK (0xff)

/** \\brief  Offset for Ifx_HSSL_ID_Bits.MODTYPE */
#define IFX_HSSL_ID_MODTYPE_OFF (8)

/** \\brief  Length for Ifx_HSSL_IS_CA_Bits.CURR */
#define IFX_HSSL_IS_CA_CURR_LEN (27)

/** \\brief  Mask for Ifx_HSSL_IS_CA_Bits.CURR */
#define IFX_HSSL_IS_CA_CURR_MSK (0x7ffffff)

/** \\brief  Offset for Ifx_HSSL_IS_CA_Bits.CURR */
#define IFX_HSSL_IS_CA_CURR_OFF (5)

/** \\brief  Length for Ifx_HSSL_IS_FC_Bits.CURCOUNT */
#define IFX_HSSL_IS_FC_CURCOUNT_LEN (16)

/** \\brief  Mask for Ifx_HSSL_IS_FC_Bits.CURCOUNT */
#define IFX_HSSL_IS_FC_CURCOUNT_MSK (0xffff)

/** \\brief  Offset for Ifx_HSSL_IS_FC_Bits.CURCOUNT */
#define IFX_HSSL_IS_FC_CURCOUNT_OFF (16)

/** \\brief  Length for Ifx_HSSL_IS_FC_Bits.RELCOUNT */
#define IFX_HSSL_IS_FC_RELCOUNT_LEN (16)

/** \\brief  Mask for Ifx_HSSL_IS_FC_Bits.RELCOUNT */
#define IFX_HSSL_IS_FC_RELCOUNT_MSK (0xffff)

/** \\brief  Offset for Ifx_HSSL_IS_FC_Bits.RELCOUNT */
#define IFX_HSSL_IS_FC_RELCOUNT_OFF (0)

/** \\brief  Length for Ifx_HSSL_ISSA_Bits.START */
#define IFX_HSSL_ISSA_START_LEN (27)

/** \\brief  Mask for Ifx_HSSL_ISSA_Bits.START */
#define IFX_HSSL_ISSA_START_MSK (0x7ffffff)

/** \\brief  Offset for Ifx_HSSL_ISSA_Bits.START */
#define IFX_HSSL_ISSA_START_OFF (5)

/** \\brief  Length for Ifx_HSSL_KRST0_Bits.RST */
#define IFX_HSSL_KRST0_RST_LEN (1)

/** \\brief  Mask for Ifx_HSSL_KRST0_Bits.RST */
#define IFX_HSSL_KRST0_RST_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_KRST0_Bits.RST */
#define IFX_HSSL_KRST0_RST_OFF (0)

/** \\brief  Length for Ifx_HSSL_KRST0_Bits.RSTSTAT */
#define IFX_HSSL_KRST0_RSTSTAT_LEN (1)

/** \\brief  Mask for Ifx_HSSL_KRST0_Bits.RSTSTAT */
#define IFX_HSSL_KRST0_RSTSTAT_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_KRST0_Bits.RSTSTAT */
#define IFX_HSSL_KRST0_RSTSTAT_OFF (1)

/** \\brief  Length for Ifx_HSSL_KRST1_Bits.RST */
#define IFX_HSSL_KRST1_RST_LEN (1)

/** \\brief  Mask for Ifx_HSSL_KRST1_Bits.RST */
#define IFX_HSSL_KRST1_RST_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_KRST1_Bits.RST */
#define IFX_HSSL_KRST1_RST_OFF (0)

/** \\brief  Length for Ifx_HSSL_KRSTCLR_Bits.CLR */
#define IFX_HSSL_KRSTCLR_CLR_LEN (1)

/** \\brief  Mask for Ifx_HSSL_KRSTCLR_Bits.CLR */
#define IFX_HSSL_KRSTCLR_CLR_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_KRSTCLR_Bits.CLR */
#define IFX_HSSL_KRSTCLR_CLR_OFF (0)

/** \\brief  Length for Ifx_HSSL_MFLAGS_Bits.CRCE */
#define IFX_HSSL_MFLAGS_CRCE_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGS_Bits.CRCE */
#define IFX_HSSL_MFLAGS_CRCE_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGS_Bits.CRCE */
#define IFX_HSSL_MFLAGS_CRCE_OFF (25)

/** \\brief  Length for Ifx_HSSL_MFLAGS_Bits.IMB */
#define IFX_HSSL_MFLAGS_IMB_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGS_Bits.IMB */
#define IFX_HSSL_MFLAGS_IMB_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGS_Bits.IMB */
#define IFX_HSSL_MFLAGS_IMB_OFF (19)

/** \\brief  Length for Ifx_HSSL_MFLAGS_Bits.INI */
#define IFX_HSSL_MFLAGS_INI_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGS_Bits.INI */
#define IFX_HSSL_MFLAGS_INI_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGS_Bits.INI */
#define IFX_HSSL_MFLAGS_INI_OFF (31)

/** \\brief  Length for Ifx_HSSL_MFLAGS_Bits.ISB */
#define IFX_HSSL_MFLAGS_ISB_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGS_Bits.ISB */
#define IFX_HSSL_MFLAGS_ISB_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGS_Bits.ISB */
#define IFX_HSSL_MFLAGS_ISB_OFF (20)

/** \\brief  Length for Ifx_HSSL_MFLAGS_Bits.MAV */
#define IFX_HSSL_MFLAGS_MAV_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGS_Bits.MAV */
#define IFX_HSSL_MFLAGS_MAV_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGS_Bits.MAV */
#define IFX_HSSL_MFLAGS_MAV_OFF (21)

