HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxHssl_bf.h
/** \\brief  Length for Ifx_HSSL_MFLAGS_Bits.NACK */
#define IFX_HSSL_MFLAGS_NACK_LEN (4)

/** \\brief  Mask for Ifx_HSSL_MFLAGS_Bits.NACK */
#define IFX_HSSL_MFLAGS_NACK_MSK (0xf)

/** \\brief  Offset for Ifx_HSSL_MFLAGS_Bits.NACK */
#define IFX_HSSL_MFLAGS_NACK_OFF (0)

/** \\brief  Length for Ifx_HSSL_MFLAGS_Bits.PIE1 */
#define IFX_HSSL_MFLAGS_PIE1_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGS_Bits.PIE1 */
#define IFX_HSSL_MFLAGS_PIE1_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGS_Bits.PIE1 */
#define IFX_HSSL_MFLAGS_PIE1_OFF (23)

/** \\brief  Length for Ifx_HSSL_MFLAGS_Bits.PIE2 */
#define IFX_HSSL_MFLAGS_PIE2_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGS_Bits.PIE2 */
#define IFX_HSSL_MFLAGS_PIE2_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGS_Bits.PIE2 */
#define IFX_HSSL_MFLAGS_PIE2_OFF (24)

/** \\brief  Length for Ifx_HSSL_MFLAGS_Bits.SRIE */
#define IFX_HSSL_MFLAGS_SRIE_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGS_Bits.SRIE */
#define IFX_HSSL_MFLAGS_SRIE_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGS_Bits.SRIE */
#define IFX_HSSL_MFLAGS_SRIE_OFF (22)

/** \\brief  Length for Ifx_HSSL_MFLAGS_Bits.TEI */
#define IFX_HSSL_MFLAGS_TEI_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGS_Bits.TEI */
#define IFX_HSSL_MFLAGS_TEI_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGS_Bits.TEI */
#define IFX_HSSL_MFLAGS_TEI_OFF (29)

/** \\brief  Length for Ifx_HSSL_MFLAGS_Bits.TEO */
#define IFX_HSSL_MFLAGS_TEO_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGS_Bits.TEO */
#define IFX_HSSL_MFLAGS_TEO_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGS_Bits.TEO */
#define IFX_HSSL_MFLAGS_TEO_OFF (30)

/** \\brief  Length for Ifx_HSSL_MFLAGS_Bits.TIMEOUT */
#define IFX_HSSL_MFLAGS_TIMEOUT_LEN (4)

/** \\brief  Mask for Ifx_HSSL_MFLAGS_Bits.TIMEOUT */
#define IFX_HSSL_MFLAGS_TIMEOUT_MSK (0xf)

/** \\brief  Offset for Ifx_HSSL_MFLAGS_Bits.TIMEOUT */
#define IFX_HSSL_MFLAGS_TIMEOUT_OFF (8)

/** \\brief  Length for Ifx_HSSL_MFLAGS_Bits.TMB */
#define IFX_HSSL_MFLAGS_TMB_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGS_Bits.TMB */
#define IFX_HSSL_MFLAGS_TMB_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGS_Bits.TMB */
#define IFX_HSSL_MFLAGS_TMB_OFF (18)

/** \\brief  Length for Ifx_HSSL_MFLAGS_Bits.TSE */
#define IFX_HSSL_MFLAGS_TSE_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGS_Bits.TSE */
#define IFX_HSSL_MFLAGS_TSE_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGS_Bits.TSE */
#define IFX_HSSL_MFLAGS_TSE_OFF (28)

/** \\brief  Length for Ifx_HSSL_MFLAGS_Bits.TTE */
#define IFX_HSSL_MFLAGS_TTE_LEN (4)

/** \\brief  Mask for Ifx_HSSL_MFLAGS_Bits.TTE */
#define IFX_HSSL_MFLAGS_TTE_MSK (0xf)

/** \\brief  Offset for Ifx_HSSL_MFLAGS_Bits.TTE */
#define IFX_HSSL_MFLAGS_TTE_OFF (4)

/** \\brief  Length for Ifx_HSSL_MFLAGS_Bits.UNEXPECTED */
#define IFX_HSSL_MFLAGS_UNEXPECTED_LEN (4)

/** \\brief  Mask for Ifx_HSSL_MFLAGS_Bits.UNEXPECTED */
#define IFX_HSSL_MFLAGS_UNEXPECTED_MSK (0xf)

/** \\brief  Offset for Ifx_HSSL_MFLAGS_Bits.UNEXPECTED */
#define IFX_HSSL_MFLAGS_UNEXPECTED_OFF (12)

/** \\brief  Length for Ifx_HSSL_MFLAGSCL_Bits.CRCEC */
#define IFX_HSSL_MFLAGSCL_CRCEC_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGSCL_Bits.CRCEC */
#define IFX_HSSL_MFLAGSCL_CRCEC_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGSCL_Bits.CRCEC */
#define IFX_HSSL_MFLAGSCL_CRCEC_OFF (25)

/** \\brief  Length for Ifx_HSSL_MFLAGSCL_Bits.IMBC */
#define IFX_HSSL_MFLAGSCL_IMBC_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGSCL_Bits.IMBC */
#define IFX_HSSL_MFLAGSCL_IMBC_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGSCL_Bits.IMBC */
#define IFX_HSSL_MFLAGSCL_IMBC_OFF (19)

/** \\brief  Length for Ifx_HSSL_MFLAGSCL_Bits.INIC */
#define IFX_HSSL_MFLAGSCL_INIC_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGSCL_Bits.INIC */
#define IFX_HSSL_MFLAGSCL_INIC_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGSCL_Bits.INIC */
#define IFX_HSSL_MFLAGSCL_INIC_OFF (31)

/** \\brief  Length for Ifx_HSSL_MFLAGSCL_Bits.ISBC */
#define IFX_HSSL_MFLAGSCL_ISBC_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGSCL_Bits.ISBC */
#define IFX_HSSL_MFLAGSCL_ISBC_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGSCL_Bits.ISBC */
#define IFX_HSSL_MFLAGSCL_ISBC_OFF (20)

/** \\brief  Length for Ifx_HSSL_MFLAGSCL_Bits.MAVC */
#define IFX_HSSL_MFLAGSCL_MAVC_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGSCL_Bits.MAVC */
#define IFX_HSSL_MFLAGSCL_MAVC_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGSCL_Bits.MAVC */
#define IFX_HSSL_MFLAGSCL_MAVC_OFF (21)

/** \\brief  Length for Ifx_HSSL_MFLAGSCL_Bits.NACKC */
#define IFX_HSSL_MFLAGSCL_NACKC_LEN (4)

/** \\brief  Mask for Ifx_HSSL_MFLAGSCL_Bits.NACKC */
#define IFX_HSSL_MFLAGSCL_NACKC_MSK (0xf)

/** \\brief  Offset for Ifx_HSSL_MFLAGSCL_Bits.NACKC */
#define IFX_HSSL_MFLAGSCL_NACKC_OFF (0)

/** \\brief  Length for Ifx_HSSL_MFLAGSCL_Bits.PIE1C */
#define IFX_HSSL_MFLAGSCL_PIE1C_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGSCL_Bits.PIE1C */
#define IFX_HSSL_MFLAGSCL_PIE1C_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGSCL_Bits.PIE1C */
#define IFX_HSSL_MFLAGSCL_PIE1C_OFF (23)

/** \\brief  Length for Ifx_HSSL_MFLAGSCL_Bits.PIE2C */
#define IFX_HSSL_MFLAGSCL_PIE2C_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGSCL_Bits.PIE2C */
#define IFX_HSSL_MFLAGSCL_PIE2C_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGSCL_Bits.PIE2C */
#define IFX_HSSL_MFLAGSCL_PIE2C_OFF (24)

/** \\brief  Length for Ifx_HSSL_MFLAGSCL_Bits.SRIEC */
#define IFX_HSSL_MFLAGSCL_SRIEC_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGSCL_Bits.SRIEC */
#define IFX_HSSL_MFLAGSCL_SRIEC_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGSCL_Bits.SRIEC */
#define IFX_HSSL_MFLAGSCL_SRIEC_OFF (22)

/** \\brief  Length for Ifx_HSSL_MFLAGSCL_Bits.TEOC */
#define IFX_HSSL_MFLAGSCL_TEOC_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGSCL_Bits.TEOC */
#define IFX_HSSL_MFLAGSCL_TEOC_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGSCL_Bits.TEOC */
#define IFX_HSSL_MFLAGSCL_TEOC_OFF (30)

/** \\brief  Length for Ifx_HSSL_MFLAGSCL_Bits.TIMEOUTC */
#define IFX_HSSL_MFLAGSCL_TIMEOUTC_LEN (4)

/** \\brief  Mask for Ifx_HSSL_MFLAGSCL_Bits.TIMEOUTC */
#define IFX_HSSL_MFLAGSCL_TIMEOUTC_MSK (0xf)

/** \\brief  Offset for Ifx_HSSL_MFLAGSCL_Bits.TIMEOUTC */
#define IFX_HSSL_MFLAGSCL_TIMEOUTC_OFF (8)

/** \\brief  Length for Ifx_HSSL_MFLAGSCL_Bits.TMBC */
#define IFX_HSSL_MFLAGSCL_TMBC_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGSCL_Bits.TMBC */
#define IFX_HSSL_MFLAGSCL_TMBC_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGSCL_Bits.TMBC */
#define IFX_HSSL_MFLAGSCL_TMBC_OFF (18)

