HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxHssl_bf.h
/** \\brief  Length for Ifx_HSSL_MFLAGSCL_Bits.TSEC */
#define IFX_HSSL_MFLAGSCL_TSEC_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGSCL_Bits.TSEC */
#define IFX_HSSL_MFLAGSCL_TSEC_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGSCL_Bits.TSEC */
#define IFX_HSSL_MFLAGSCL_TSEC_OFF (28)

/** \\brief  Length for Ifx_HSSL_MFLAGSCL_Bits.TTEC */
#define IFX_HSSL_MFLAGSCL_TTEC_LEN (4)

/** \\brief  Mask for Ifx_HSSL_MFLAGSCL_Bits.TTEC */
#define IFX_HSSL_MFLAGSCL_TTEC_MSK (0xf)

/** \\brief  Offset for Ifx_HSSL_MFLAGSCL_Bits.TTEC */
#define IFX_HSSL_MFLAGSCL_TTEC_OFF (4)

/** \\brief  Length for Ifx_HSSL_MFLAGSCL_Bits.UNEXPECTEDC */
#define IFX_HSSL_MFLAGSCL_UNEXPECTEDC_LEN (4)

/** \\brief  Mask for Ifx_HSSL_MFLAGSCL_Bits.UNEXPECTEDC */
#define IFX_HSSL_MFLAGSCL_UNEXPECTEDC_MSK (0xf)

/** \\brief  Offset for Ifx_HSSL_MFLAGSCL_Bits.UNEXPECTEDC */
#define IFX_HSSL_MFLAGSCL_UNEXPECTEDC_OFF (12)

/** \\brief  Length for Ifx_HSSL_MFLAGSEN_Bits.CRCEEN */
#define IFX_HSSL_MFLAGSEN_CRCEEN_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGSEN_Bits.CRCEEN */
#define IFX_HSSL_MFLAGSEN_CRCEEN_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGSEN_Bits.CRCEEN */
#define IFX_HSSL_MFLAGSEN_CRCEEN_OFF (25)

/** \\brief  Length for Ifx_HSSL_MFLAGSEN_Bits.MAVEN */
#define IFX_HSSL_MFLAGSEN_MAVEN_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGSEN_Bits.MAVEN */
#define IFX_HSSL_MFLAGSEN_MAVEN_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGSEN_Bits.MAVEN */
#define IFX_HSSL_MFLAGSEN_MAVEN_OFF (21)

/** \\brief  Length for Ifx_HSSL_MFLAGSEN_Bits.NACKEN */
#define IFX_HSSL_MFLAGSEN_NACKEN_LEN (4)

/** \\brief  Mask for Ifx_HSSL_MFLAGSEN_Bits.NACKEN */
#define IFX_HSSL_MFLAGSEN_NACKEN_MSK (0xf)

/** \\brief  Offset for Ifx_HSSL_MFLAGSEN_Bits.NACKEN */
#define IFX_HSSL_MFLAGSEN_NACKEN_OFF (0)

/** \\brief  Length for Ifx_HSSL_MFLAGSEN_Bits.PIE1EN */
#define IFX_HSSL_MFLAGSEN_PIE1EN_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGSEN_Bits.PIE1EN */
#define IFX_HSSL_MFLAGSEN_PIE1EN_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGSEN_Bits.PIE1EN */
#define IFX_HSSL_MFLAGSEN_PIE1EN_OFF (23)

/** \\brief  Length for Ifx_HSSL_MFLAGSEN_Bits.PIE2EN */
#define IFX_HSSL_MFLAGSEN_PIE2EN_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGSEN_Bits.PIE2EN */
#define IFX_HSSL_MFLAGSEN_PIE2EN_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGSEN_Bits.PIE2EN */
#define IFX_HSSL_MFLAGSEN_PIE2EN_OFF (24)

/** \\brief  Length for Ifx_HSSL_MFLAGSEN_Bits.SRIEEN */
#define IFX_HSSL_MFLAGSEN_SRIEEN_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGSEN_Bits.SRIEEN */
#define IFX_HSSL_MFLAGSEN_SRIEEN_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGSEN_Bits.SRIEEN */
#define IFX_HSSL_MFLAGSEN_SRIEEN_OFF (22)

/** \\brief  Length for Ifx_HSSL_MFLAGSEN_Bits.TEIEN */
#define IFX_HSSL_MFLAGSEN_TEIEN_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGSEN_Bits.TEIEN */
#define IFX_HSSL_MFLAGSEN_TEIEN_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGSEN_Bits.TEIEN */
#define IFX_HSSL_MFLAGSEN_TEIEN_OFF (29)

/** \\brief  Length for Ifx_HSSL_MFLAGSEN_Bits.TIMEOUTEN */
#define IFX_HSSL_MFLAGSEN_TIMEOUTEN_LEN (4)

/** \\brief  Mask for Ifx_HSSL_MFLAGSEN_Bits.TIMEOUTEN */
#define IFX_HSSL_MFLAGSEN_TIMEOUTEN_MSK (0xf)

/** \\brief  Offset for Ifx_HSSL_MFLAGSEN_Bits.TIMEOUTEN */
#define IFX_HSSL_MFLAGSEN_TIMEOUTEN_OFF (8)

/** \\brief  Length for Ifx_HSSL_MFLAGSEN_Bits.TTEEN */
#define IFX_HSSL_MFLAGSEN_TTEEN_LEN (4)

/** \\brief  Mask for Ifx_HSSL_MFLAGSEN_Bits.TTEEN */
#define IFX_HSSL_MFLAGSEN_TTEEN_MSK (0xf)

/** \\brief  Offset for Ifx_HSSL_MFLAGSEN_Bits.TTEEN */
#define IFX_HSSL_MFLAGSEN_TTEEN_OFF (4)

/** \\brief  Length for Ifx_HSSL_MFLAGSEN_Bits.UNEXPECTEDEN */
#define IFX_HSSL_MFLAGSEN_UNEXPECTEDEN_LEN (4)

/** \\brief  Mask for Ifx_HSSL_MFLAGSEN_Bits.UNEXPECTEDEN */
#define IFX_HSSL_MFLAGSEN_UNEXPECTEDEN_MSK (0xf)

/** \\brief  Offset for Ifx_HSSL_MFLAGSEN_Bits.UNEXPECTEDEN */
#define IFX_HSSL_MFLAGSEN_UNEXPECTEDEN_OFF (12)

/** \\brief  Length for Ifx_HSSL_MFLAGSSET_Bits.CRCES */
#define IFX_HSSL_MFLAGSSET_CRCES_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGSSET_Bits.CRCES */
#define IFX_HSSL_MFLAGSSET_CRCES_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGSSET_Bits.CRCES */
#define IFX_HSSL_MFLAGSSET_CRCES_OFF (25)

/** \\brief  Length for Ifx_HSSL_MFLAGSSET_Bits.IMBS */
#define IFX_HSSL_MFLAGSSET_IMBS_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGSSET_Bits.IMBS */
#define IFX_HSSL_MFLAGSSET_IMBS_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGSSET_Bits.IMBS */
#define IFX_HSSL_MFLAGSSET_IMBS_OFF (19)

/** \\brief  Length for Ifx_HSSL_MFLAGSSET_Bits.INIS */
#define IFX_HSSL_MFLAGSSET_INIS_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGSSET_Bits.INIS */
#define IFX_HSSL_MFLAGSSET_INIS_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGSSET_Bits.INIS */
#define IFX_HSSL_MFLAGSSET_INIS_OFF (31)

/** \\brief  Length for Ifx_HSSL_MFLAGSSET_Bits.ISBS */
#define IFX_HSSL_MFLAGSSET_ISBS_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGSSET_Bits.ISBS */
#define IFX_HSSL_MFLAGSSET_ISBS_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGSSET_Bits.ISBS */
#define IFX_HSSL_MFLAGSSET_ISBS_OFF (20)

/** \\brief  Length for Ifx_HSSL_MFLAGSSET_Bits.MAVS */
#define IFX_HSSL_MFLAGSSET_MAVS_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGSSET_Bits.MAVS */
#define IFX_HSSL_MFLAGSSET_MAVS_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGSSET_Bits.MAVS */
#define IFX_HSSL_MFLAGSSET_MAVS_OFF (21)

/** \\brief  Length for Ifx_HSSL_MFLAGSSET_Bits.NACKS */
#define IFX_HSSL_MFLAGSSET_NACKS_LEN (4)

/** \\brief  Mask for Ifx_HSSL_MFLAGSSET_Bits.NACKS */
#define IFX_HSSL_MFLAGSSET_NACKS_MSK (0xf)

/** \\brief  Offset for Ifx_HSSL_MFLAGSSET_Bits.NACKS */
#define IFX_HSSL_MFLAGSSET_NACKS_OFF (0)

/** \\brief  Length for Ifx_HSSL_MFLAGSSET_Bits.PIE1S */
#define IFX_HSSL_MFLAGSSET_PIE1S_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGSSET_Bits.PIE1S */
#define IFX_HSSL_MFLAGSSET_PIE1S_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGSSET_Bits.PIE1S */
#define IFX_HSSL_MFLAGSSET_PIE1S_OFF (23)

/** \\brief  Length for Ifx_HSSL_MFLAGSSET_Bits.PIE2S */
#define IFX_HSSL_MFLAGSSET_PIE2S_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGSSET_Bits.PIE2S */
#define IFX_HSSL_MFLAGSSET_PIE2S_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGSSET_Bits.PIE2S */
#define IFX_HSSL_MFLAGSSET_PIE2S_OFF (24)

/** \\brief  Length for Ifx_HSSL_MFLAGSSET_Bits.SRIES */
#define IFX_HSSL_MFLAGSSET_SRIES_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGSSET_Bits.SRIES */
#define IFX_HSSL_MFLAGSSET_SRIES_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGSSET_Bits.SRIES */
#define IFX_HSSL_MFLAGSSET_SRIES_OFF (22)

