HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxHssl_bf.h
/** \\brief  Length for Ifx_HSSL_MFLAGSSET_Bits.TEOS */
#define IFX_HSSL_MFLAGSSET_TEOS_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGSSET_Bits.TEOS */
#define IFX_HSSL_MFLAGSSET_TEOS_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGSSET_Bits.TEOS */
#define IFX_HSSL_MFLAGSSET_TEOS_OFF (30)

/** \\brief  Length for Ifx_HSSL_MFLAGSSET_Bits.TIMEOUTS */
#define IFX_HSSL_MFLAGSSET_TIMEOUTS_LEN (4)

/** \\brief  Mask for Ifx_HSSL_MFLAGSSET_Bits.TIMEOUTS */
#define IFX_HSSL_MFLAGSSET_TIMEOUTS_MSK (0xf)

/** \\brief  Offset for Ifx_HSSL_MFLAGSSET_Bits.TIMEOUTS */
#define IFX_HSSL_MFLAGSSET_TIMEOUTS_OFF (8)

/** \\brief  Length for Ifx_HSSL_MFLAGSSET_Bits.TMBS */
#define IFX_HSSL_MFLAGSSET_TMBS_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGSSET_Bits.TMBS */
#define IFX_HSSL_MFLAGSSET_TMBS_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGSSET_Bits.TMBS */
#define IFX_HSSL_MFLAGSSET_TMBS_OFF (18)

/** \\brief  Length for Ifx_HSSL_MFLAGSSET_Bits.TSES */
#define IFX_HSSL_MFLAGSSET_TSES_LEN (1)

/** \\brief  Mask for Ifx_HSSL_MFLAGSSET_Bits.TSES */
#define IFX_HSSL_MFLAGSSET_TSES_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_MFLAGSSET_Bits.TSES */
#define IFX_HSSL_MFLAGSSET_TSES_OFF (28)

/** \\brief  Length for Ifx_HSSL_MFLAGSSET_Bits.TTES */
#define IFX_HSSL_MFLAGSSET_TTES_LEN (4)

/** \\brief  Mask for Ifx_HSSL_MFLAGSSET_Bits.TTES */
#define IFX_HSSL_MFLAGSSET_TTES_MSK (0xf)

/** \\brief  Offset for Ifx_HSSL_MFLAGSSET_Bits.TTES */
#define IFX_HSSL_MFLAGSSET_TTES_OFF (4)

/** \\brief  Length for Ifx_HSSL_MFLAGSSET_Bits.UNEXPECTEDS */
#define IFX_HSSL_MFLAGSSET_UNEXPECTEDS_LEN (4)

/** \\brief  Mask for Ifx_HSSL_MFLAGSSET_Bits.UNEXPECTEDS */
#define IFX_HSSL_MFLAGSSET_UNEXPECTEDS_MSK (0xf)

/** \\brief  Offset for Ifx_HSSL_MFLAGSSET_Bits.UNEXPECTEDS */
#define IFX_HSSL_MFLAGSSET_UNEXPECTEDS_OFF (12)

/** \\brief  Length for Ifx_HSSL_OCS_Bits.SUS */
#define IFX_HSSL_OCS_SUS_LEN (4)

/** \\brief  Mask for Ifx_HSSL_OCS_Bits.SUS */
#define IFX_HSSL_OCS_SUS_MSK (0xf)

/** \\brief  Offset for Ifx_HSSL_OCS_Bits.SUS */
#define IFX_HSSL_OCS_SUS_OFF (24)

/** \\brief  Length for Ifx_HSSL_OCS_Bits.SUS_P */
#define IFX_HSSL_OCS_SUS_P_LEN (1)

/** \\brief  Mask for Ifx_HSSL_OCS_Bits.SUS_P */
#define IFX_HSSL_OCS_SUS_P_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_OCS_Bits.SUS_P */
#define IFX_HSSL_OCS_SUS_P_OFF (28)

/** \\brief  Length for Ifx_HSSL_OCS_Bits.SUSSTA */
#define IFX_HSSL_OCS_SUSSTA_LEN (1)

/** \\brief  Mask for Ifx_HSSL_OCS_Bits.SUSSTA */
#define IFX_HSSL_OCS_SUSSTA_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_OCS_Bits.SUSSTA */
#define IFX_HSSL_OCS_SUSSTA_OFF (29)

/** \\brief  Length for Ifx_HSSL_OCS_Bits.TG_P */
#define IFX_HSSL_OCS_TG_P_LEN (1)

/** \\brief  Mask for Ifx_HSSL_OCS_Bits.TG_P */
#define IFX_HSSL_OCS_TG_P_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_OCS_Bits.TG_P */
#define IFX_HSSL_OCS_TG_P_OFF (3)

/** \\brief  Length for Ifx_HSSL_OCS_Bits.TGB */
#define IFX_HSSL_OCS_TGB_LEN (1)

/** \\brief  Mask for Ifx_HSSL_OCS_Bits.TGB */
#define IFX_HSSL_OCS_TGB_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_OCS_Bits.TGB */
#define IFX_HSSL_OCS_TGB_OFF (2)

/** \\brief  Length for Ifx_HSSL_OCS_Bits.TGS */
#define IFX_HSSL_OCS_TGS_LEN (2)

/** \\brief  Mask for Ifx_HSSL_OCS_Bits.TGS */
#define IFX_HSSL_OCS_TGS_MSK (0x3)

/** \\brief  Offset for Ifx_HSSL_OCS_Bits.TGS */
#define IFX_HSSL_OCS_TGS_OFF (0)

/** \\brief  Length for Ifx_HSSL_QFLAGS_Bits.E0 */
#define IFX_HSSL_QFLAGS_E0_LEN (2)

/** \\brief  Mask for Ifx_HSSL_QFLAGS_Bits.E0 */
#define IFX_HSSL_QFLAGS_E0_MSK (0x3)

/** \\brief  Offset for Ifx_HSSL_QFLAGS_Bits.E0 */
#define IFX_HSSL_QFLAGS_E0_OFF (16)

/** \\brief  Length for Ifx_HSSL_QFLAGS_Bits.E1 */
#define IFX_HSSL_QFLAGS_E1_LEN (2)

/** \\brief  Mask for Ifx_HSSL_QFLAGS_Bits.E1 */
#define IFX_HSSL_QFLAGS_E1_MSK (0x3)

/** \\brief  Offset for Ifx_HSSL_QFLAGS_Bits.E1 */
#define IFX_HSSL_QFLAGS_E1_OFF (18)

/** \\brief  Length for Ifx_HSSL_QFLAGS_Bits.E2 */
#define IFX_HSSL_QFLAGS_E2_LEN (2)

/** \\brief  Mask for Ifx_HSSL_QFLAGS_Bits.E2 */
#define IFX_HSSL_QFLAGS_E2_MSK (0x3)

/** \\brief  Offset for Ifx_HSSL_QFLAGS_Bits.E2 */
#define IFX_HSSL_QFLAGS_E2_OFF (20)

/** \\brief  Length for Ifx_HSSL_QFLAGS_Bits.E3 */
#define IFX_HSSL_QFLAGS_E3_LEN (2)

/** \\brief  Mask for Ifx_HSSL_QFLAGS_Bits.E3 */
#define IFX_HSSL_QFLAGS_E3_MSK (0x3)

/** \\brief  Offset for Ifx_HSSL_QFLAGS_Bits.E3 */
#define IFX_HSSL_QFLAGS_E3_OFF (22)

/** \\brief  Length for Ifx_HSSL_QFLAGS_Bits.ES */
#define IFX_HSSL_QFLAGS_ES_LEN (1)

/** \\brief  Mask for Ifx_HSSL_QFLAGS_Bits.ES */
#define IFX_HSSL_QFLAGS_ES_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_QFLAGS_Bits.ES */
#define IFX_HSSL_QFLAGS_ES_OFF (31)

/** \\brief  Length for Ifx_HSSL_QFLAGS_Bits.I */
#define IFX_HSSL_QFLAGS_I_LEN (4)

/** \\brief  Mask for Ifx_HSSL_QFLAGS_Bits.I */
#define IFX_HSSL_QFLAGS_I_MSK (0xf)

/** \\brief  Offset for Ifx_HSSL_QFLAGS_Bits.I */
#define IFX_HSSL_QFLAGS_I_OFF (0)

/** \\brief  Length for Ifx_HSSL_QFLAGS_Bits.IS */
#define IFX_HSSL_QFLAGS_IS_LEN (1)

/** \\brief  Mask for Ifx_HSSL_QFLAGS_Bits.IS */
#define IFX_HSSL_QFLAGS_IS_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_QFLAGS_Bits.IS */
#define IFX_HSSL_QFLAGS_IS_OFF (28)

/** \\brief  Length for Ifx_HSSL_QFLAGS_Bits.R */
#define IFX_HSSL_QFLAGS_R_LEN (4)

/** \\brief  Mask for Ifx_HSSL_QFLAGS_Bits.R */
#define IFX_HSSL_QFLAGS_R_MSK (0xf)

/** \\brief  Offset for Ifx_HSSL_QFLAGS_Bits.R */
#define IFX_HSSL_QFLAGS_R_OFF (8)

/** \\brief  Length for Ifx_HSSL_QFLAGS_Bits.RS */
#define IFX_HSSL_QFLAGS_RS_LEN (1)

/** \\brief  Mask for Ifx_HSSL_QFLAGS_Bits.RS */
#define IFX_HSSL_QFLAGS_RS_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_QFLAGS_Bits.RS */
#define IFX_HSSL_QFLAGS_RS_OFF (29)

/** \\brief  Length for Ifx_HSSL_QFLAGS_Bits.T */
#define IFX_HSSL_QFLAGS_T_LEN (4)

/** \\brief  Mask for Ifx_HSSL_QFLAGS_Bits.T */
#define IFX_HSSL_QFLAGS_T_MSK (0xf)

/** \\brief  Offset for Ifx_HSSL_QFLAGS_Bits.T */
#define IFX_HSSL_QFLAGS_T_OFF (4)

/** \\brief  Length for Ifx_HSSL_QFLAGS_Bits.TS */
#define IFX_HSSL_QFLAGS_TS_LEN (1)

