HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxHssl_bf.h
/** \\brief  Mask for Ifx_HSSL_QFLAGS_Bits.TS */
#define IFX_HSSL_QFLAGS_TS_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_QFLAGS_Bits.TS */
#define IFX_HSSL_QFLAGS_TS_OFF (30)

/** \\brief  Length for Ifx_HSSL_SFSFLAGS_Bits.EXFL */
#define IFX_HSSL_SFSFLAGS_EXFL_LEN (2)

/** \\brief  Mask for Ifx_HSSL_SFSFLAGS_Bits.EXFL */
#define IFX_HSSL_SFSFLAGS_EXFL_MSK (0x3)

/** \\brief  Offset for Ifx_HSSL_SFSFLAGS_Bits.EXFL */
#define IFX_HSSL_SFSFLAGS_EXFL_OFF (4)

/** \\brief  Length for Ifx_HSSL_SFSFLAGS_Bits.ISF */
#define IFX_HSSL_SFSFLAGS_ISF_LEN (1)

/** \\brief  Mask for Ifx_HSSL_SFSFLAGS_Bits.ISF */
#define IFX_HSSL_SFSFLAGS_ISF_MSK (0x1)

/** \\brief  Offset for Ifx_HSSL_SFSFLAGS_Bits.ISF */
#define IFX_HSSL_SFSFLAGS_ISF_OFF (15)

/** \\brief  Length for Ifx_HSSL_SFSFLAGS_Bits.RXFL */
#define IFX_HSSL_SFSFLAGS_RXFL_LEN (2)

/** \\brief  Mask for Ifx_HSSL_SFSFLAGS_Bits.RXFL */
#define IFX_HSSL_SFSFLAGS_RXFL_MSK (0x3)

/** \\brief  Offset for Ifx_HSSL_SFSFLAGS_Bits.RXFL */
#define IFX_HSSL_SFSFLAGS_RXFL_OFF (0)

/** \\brief  Length for Ifx_HSSL_SFSFLAGS_Bits.TXFL */
#define IFX_HSSL_SFSFLAGS_TXFL_LEN (2)

/** \\brief  Mask for Ifx_HSSL_SFSFLAGS_Bits.TXFL */
#define IFX_HSSL_SFSFLAGS_TXFL_MSK (0x3)

/** \\brief  Offset for Ifx_HSSL_SFSFLAGS_Bits.TXFL */
#define IFX_HSSL_SFSFLAGS_TXFL_OFF (2)

/** \\brief  Length for Ifx_HSSL_T_TCA_Bits.A */
#define IFX_HSSL_T_TCA_A_LEN (32)

/** \\brief  Mask for Ifx_HSSL_T_TCA_Bits.A */
#define IFX_HSSL_T_TCA_A_MSK (0xffffffff)

/** \\brief  Offset for Ifx_HSSL_T_TCA_Bits.A */
#define IFX_HSSL_T_TCA_A_OFF (0)

/** \\brief  Length for Ifx_HSSL_T_TCD_Bits.D */
#define IFX_HSSL_T_TCD_D_LEN (32)

/** \\brief  Mask for Ifx_HSSL_T_TCD_Bits.D */
#define IFX_HSSL_T_TCD_D_MSK (0xffffffff)

/** \\brief  Offset for Ifx_HSSL_T_TCD_Bits.D */
#define IFX_HSSL_T_TCD_D_OFF (0)

/** \\brief  Length for Ifx_HSSL_TIDADD_Bits.A */
#define IFX_HSSL_TIDADD_A_LEN (32)

/** \\brief  Mask for Ifx_HSSL_TIDADD_Bits.A */
#define IFX_HSSL_TIDADD_A_MSK (0xffffffff)

/** \\brief  Offset for Ifx_HSSL_TIDADD_Bits.A */
#define IFX_HSSL_TIDADD_A_OFF (0)

/** \\brief  Length for Ifx_HSSL_TS_CA_Bits.CURR */
#define IFX_HSSL_TS_CA_CURR_LEN (27)

/** \\brief  Mask for Ifx_HSSL_TS_CA_Bits.CURR */
#define IFX_HSSL_TS_CA_CURR_MSK (0x7ffffff)

/** \\brief  Offset for Ifx_HSSL_TS_CA_Bits.CURR */
#define IFX_HSSL_TS_CA_CURR_OFF (5)

/** \\brief  Length for Ifx_HSSL_TS_FC_Bits.CURCOUNT */
#define IFX_HSSL_TS_FC_CURCOUNT_LEN (16)

/** \\brief  Mask for Ifx_HSSL_TS_FC_Bits.CURCOUNT */
#define IFX_HSSL_TS_FC_CURCOUNT_MSK (0xffff)

/** \\brief  Offset for Ifx_HSSL_TS_FC_Bits.CURCOUNT */
#define IFX_HSSL_TS_FC_CURCOUNT_OFF (16)

/** \\brief  Length for Ifx_HSSL_TS_FC_Bits.RELCOUNT */
#define IFX_HSSL_TS_FC_RELCOUNT_LEN (16)

/** \\brief  Mask for Ifx_HSSL_TS_FC_Bits.RELCOUNT */
#define IFX_HSSL_TS_FC_RELCOUNT_MSK (0xffff)

/** \\brief  Offset for Ifx_HSSL_TS_FC_Bits.RELCOUNT */
#define IFX_HSSL_TS_FC_RELCOUNT_OFF (0)

/** \\brief  Length for Ifx_HSSL_TSSA_Bits.ADDR */
#define IFX_HSSL_TSSA_ADDR_LEN (27)

/** \\brief  Mask for Ifx_HSSL_TSSA_Bits.ADDR */
#define IFX_HSSL_TSSA_ADDR_MSK (0x7ffffff)

/** \\brief  Offset for Ifx_HSSL_TSSA_Bits.ADDR */
#define IFX_HSSL_TSSA_ADDR_OFF (5)

/** \\brief  Length for Ifx_HSSL_TSTAT_Bits.LASTCC0 */
#define IFX_HSSL_TSTAT_LASTCC0_LEN (5)

/** \\brief  Mask for Ifx_HSSL_TSTAT_Bits.LASTCC0 */
#define IFX_HSSL_TSTAT_LASTCC0_MSK (0x1f)

/** \\brief  Offset for Ifx_HSSL_TSTAT_Bits.LASTCC0 */
#define IFX_HSSL_TSTAT_LASTCC0_OFF (0)

/** \\brief  Length for Ifx_HSSL_TSTAT_Bits.LASTCC1 */
#define IFX_HSSL_TSTAT_LASTCC1_LEN (5)

/** \\brief  Mask for Ifx_HSSL_TSTAT_Bits.LASTCC1 */
#define IFX_HSSL_TSTAT_LASTCC1_MSK (0x1f)

/** \\brief  Offset for Ifx_HSSL_TSTAT_Bits.LASTCC1 */
#define IFX_HSSL_TSTAT_LASTCC1_OFF (8)

/** \\brief  Length for Ifx_HSSL_TSTAT_Bits.LASTCC2 */
#define IFX_HSSL_TSTAT_LASTCC2_LEN (5)

/** \\brief  Mask for Ifx_HSSL_TSTAT_Bits.LASTCC2 */
#define IFX_HSSL_TSTAT_LASTCC2_MSK (0x1f)

/** \\brief  Offset for Ifx_HSSL_TSTAT_Bits.LASTCC2 */
#define IFX_HSSL_TSTAT_LASTCC2_OFF (16)

/** \\brief  Length for Ifx_HSSL_TSTAT_Bits.LASTCC3 */
#define IFX_HSSL_TSTAT_LASTCC3_LEN (5)

/** \\brief  Mask for Ifx_HSSL_TSTAT_Bits.LASTCC3 */
#define IFX_HSSL_TSTAT_LASTCC3_MSK (0x1f)

/** \\brief  Offset for Ifx_HSSL_TSTAT_Bits.LASTCC3 */
#define IFX_HSSL_TSTAT_LASTCC3_OFF (24)

/** \\brief  Length for Ifx_HSSL_TSTAT_Bits.LASTTT0 */
#define IFX_HSSL_TSTAT_LASTTT0_LEN (3)

/** \\brief  Mask for Ifx_HSSL_TSTAT_Bits.LASTTT0 */
#define IFX_HSSL_TSTAT_LASTTT0_MSK (0x7)

/** \\brief  Offset for Ifx_HSSL_TSTAT_Bits.LASTTT0 */
#define IFX_HSSL_TSTAT_LASTTT0_OFF (5)

/** \\brief  Length for Ifx_HSSL_TSTAT_Bits.LASTTT1 */
#define IFX_HSSL_TSTAT_LASTTT1_LEN (3)

/** \\brief  Mask for Ifx_HSSL_TSTAT_Bits.LASTTT1 */
#define IFX_HSSL_TSTAT_LASTTT1_MSK (0x7)

/** \\brief  Offset for Ifx_HSSL_TSTAT_Bits.LASTTT1 */
#define IFX_HSSL_TSTAT_LASTTT1_OFF (13)

/** \\brief  Length for Ifx_HSSL_TSTAT_Bits.LASTTT2 */
#define IFX_HSSL_TSTAT_LASTTT2_LEN (3)

/** \\brief  Mask for Ifx_HSSL_TSTAT_Bits.LASTTT2 */
#define IFX_HSSL_TSTAT_LASTTT2_MSK (0x7)

/** \\brief  Offset for Ifx_HSSL_TSTAT_Bits.LASTTT2 */
#define IFX_HSSL_TSTAT_LASTTT2_OFF (21)

/** \\brief  Length for Ifx_HSSL_TSTAT_Bits.LASTTT3 */
#define IFX_HSSL_TSTAT_LASTTT3_LEN (3)

/** \\brief  Mask for Ifx_HSSL_TSTAT_Bits.LASTTT3 */
#define IFX_HSSL_TSTAT_LASTTT3_MSK (0x7)

/** \\brief  Offset for Ifx_HSSL_TSTAT_Bits.LASTTT3 */
#define IFX_HSSL_TSTAT_LASTTT3_OFF (29)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXHSSL_BF_H */
